Practicas/Practica3/Benchmarks/abhaproxy.txt
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.153.131 (be patient)


Server Software:        Apache/2.4.18
Server Hostname:        192.168.153.131
Server Port:            80

Document Path:          /index.html
Document Length:        170 bytes

Concurrency Level:      300
Time taken for tests:   9.517 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      4400000 bytes
HTML transferred:       1700000 bytes
Requests per second:    1050.70 [#/sec] (mean)
Time per request:       285.525 [ms] (mean)
Time per request:       0.952 [ms] (mean, across all concurrent requests)
Transfer rate:          451.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   8.2      2      90
Processing:    68  278  99.2    271     562
Waiting:       68  277  98.8    269     562
Total:        108  282  98.9    274     563

Percentage of the requests served within a certain time (ms)
  50%    274
  66%    321
  75%    361
  80%    383
  90%    428
  95%    455
  98%    479
  99%    493
 100%    563 (longest request)